{
    "projects":
    [
        {
            "Header":
            {
                "h2Class":"programming",
                "h2Title":"Programming",
                "h2Description":"Some chosen projects that I've written using <strong>C++ (OOP), HTML5, CSS3, JavaScript, PHP, MySQL, jQuery, Bootstrap 4, C++ Builder.</strong><br> Please check out <a href='https://github.com/ReznoRMichael' target='_blank'>my GitHub</a> for all practice exercises and code. (100+ repositories)"
            },
            
            "Thumbnails":
            [
                {
                    "ID":"0",
                    "aLink":"https://reznor.tech/online-sequential-number-text-url-link-generator.html",
                    "pDescription":"<strong>HTML, CSS, JavaScript</strong><br><br>Simple pure JavaScript code for generating custom text/links/URLs with numbers in sequential order of your chosen incrementation steps. Generates custom number of lines and can save them into a .txt file in the following template:<br>[ optional symbol/text ] + [ number ] + [ optional symbol/text ]",
                    "figCaption":"Online Sequential Number, URL & Text Generator"
                },
                {
                    "ID":"1",
                    "aLink":"https://reznor.tech/projects/ac-card-memory-game/game.html",
                    "pDescription":"<strong>HTML, CSS, JavaScript, jQuery, media queries</strong><br><br>A gift for my brother. Based on Pasja Informatyki's idea - but repaired code redundancy, improved look, added auto-generation, restart, transition effects, get rid of bugs. Features random array shuffling using the Fisher-Yates algorithm in pure JavaScript. Runs even on IE11.",
                    "figCaption":"Assassin's Creed Card Memory Game"
                },
                {
                    "ID":"2",
                    "aLink":"https://codepen.io/ReznoR/full/bJKyWp",
                    "pDescription":"<strong>HTML, CSS</strong><br><br>Responsive Web Design Projects - Build a Survey Form. My Survey Form is a simple Front-end for the user about improving my personal technology blog reznor.tech. It has stylized input fields and custom style checkboxes and radio buttons.",
                    "figCaption":"Front-end Responsive Survey Form"
                },
                {
                    "ID":"3",
                    "aLink":"https://reznor.tech/projects/php-ep5-newsletter/",
                    "pDescription":"<strong>PHP, MySQL, back-end, HTML, CSS</strong><br><br>Newsletter subscription page. Admin panel for logging in only for admins. Display all newsletter database entries of users. Using PDO library for connections. Catching exceptions. E-mail, login, password, user in database validation checking. Security code sanitization. Checking if entered e-mail already exists. Fetching a SQL table and displaying it in the browser. Session remembering. Counting the number of total records in the database. Logging out (unsetting session). Inserting a new e-mail into the database.",
                    "figCaption":"Newsletter subscription page + Admin panel"
                },
                {
                    "ID":"4",
                    "aLink":"https://reznor.tech/projects/php-ep2-4-settlers/",
                    "pDescription":"<strong>PHP, MySQL, back-end, HTML, CSS</strong><br><br>Login page. Registration of new users. Validation of password. Password hashing. Terms and Conditions check. Google reCAPTCHA. SQL injection security - code sanitization. E-mail validation. Password length and login length check. Database connection. Inserting new registered users into database. Checking if user already exists. Exception handling. Reading values from database and displaying in HTML. Date and time handling, checking and validation. Associative arrays. Page redirection. Logging in users. Remembering Sessions between pages. Logging out (unsetting session).",
                    "figCaption":"PHP & MySQL Back-end Registration Form"
                },
                {
                    "ID":"5",
                    "aLink":"https://github.com/ReznoRMichael/reznor-windows-operating-system-time-counter",
                    "pDescription":"<strong>C++ (OOP)</strong><br><br>Ninja invisible Windows application written in C++ Builder 6.0. Counts time when being open and saves it into .txt file every 15min - also after every closing, shutdown or logoff. After launch reads the contents of the file and counts further from where it finished. It also shows the user in the .txt file a translation to hours, minutes and seconds of total time counted.",
                    "figCaption":"Windows Operating System Time Counter"
                },
                {
                    "ID":"6",
                    "aLink":"https://github.com/ReznoRMichael/object-cpp-course-pasja-informatyki-episode8-windows-reznor-notepad",
                    "pDescription":"<strong>C++ (OOP)</strong><br><br>Windows GUI program written in C++ Builder 6.0. It's a Notepad that has all the usual functions, like New, Open, Save, Save As, Exit, Cut, Copy, Paste, Select All, Word Wrap, Change Font, Help, Information about the author and a link to my youtube channel. It has also a custom icon, can save .txt and .ini files. It prompts about confirmation if the text field is not empty or user wants to create a new file.",
                    "figCaption":"Notepad for Windows"
                },
                {
                    "ID":"7",
                    "aLink":"https://github.com/ReznoRMichael/reznor-custom-link-generator",
                    "pDescription":"<strong>C++ (OOP)</strong><br><br>Program that I've first written in procedural C++, and then rewritten using Classes, Member Functions and a Stopwatch specifically for myself for generating deviantart comments links and saving them into a text file. It asks the user for the custom link text - if you type 0 it will use the default text. Then it asks the user for the starting [link_number], then for the ending [link_number]. Then it calculates how many total links it will generate, starts the timer, and begins saving all the links into generated_links.txt file. After the saving is completed, it stops the timer, and shows the time it took to generate and save the file in seconds.",
                    "figCaption":"Custom Link Generator"
                },
                {
                    "ID":"8",
                    "aLink":"https://reznor.tech/projects/php-ep6-school/",
                    "pDescription":"<strong>PHP, MySQL, back-end (PDO), HTML, CSS</strong><br><br>Click for live version. Learning PHP/MySQL and exam exercise. Connecting to a simulated school database. Read data from table. Present the data in a table on screen. Insert data into table. Sanitize entered data. All connections are done using PDO. Session remembers entered form data.",
                    "figCaption":"PHP & MySQL Back-end (Student database)"
                }
            ]
        },
        {
            "Header":
            {
                "h2Class":"graphicdesign",
                "h2Title":"Graphic Design",
                "h2Description":"My graphic designer journey started when someone noticed that I enjoyed taking photos and using graphics editing software - one company took me on an intern and I learned there from a much more experienced mentor and through practice. After a year I was working as a Lead Graphic Designer in a small all-in-one advertising and printing company for almost 7 years. Here are some of the works that I've done working in both companies (2009 - 2017). Both companies required doing it quickly and with simple tools (quantity over quality). I always had great attention to details and wish of learning and self-improvement, so in the long run I couldn't realize my full potential while working in this role. My mind was thirsty of more challenges and problems to solve."
            },
            
            "Thumbnails":
            [
                {
                    "ID":"0",
                    "aLink":"electronic",
                    "pDescription":"<strong>Electronic/Screen Media</strong><br>Electronic Digital Design, Digital Editing, Photo Montage, Photography Editing/Correction...",
                    "figCaption":"Electronic/Screen Media",
                    "photosAmount":"2"
                },
                {
                    "ID":"1",
                    "aLink":"smallformat",
                    "pDescription":"<strong>Small Format Prints</strong><br>Business Cards, Leaflets, Calendars...",
                    "figCaption":"Small Format Prints",
                    "photosAmount":"73"
                },
                {
                    "ID":"2",
                    "aLink":"visual",
                    "pDescription":"<strong>Visual Identity</strong><br>Visual Identity for companies, Front Shop/Office Windows etc...",
                    "figCaption":"Visual Identity",
                    "photosAmount":"43"
                },
                {
                    "ID":"3",
                    "aLink":"bigformat",
                    "pDescription":"<strong>Large Format Prints</strong><br>Boards, Banners, Window Ads, Large Posters, Exterior...",
                    "figCaption":"Large Format Prints",
                    "photosAmount":"36"
                },
                {
                    "ID":"4",
                    "aLink":"cars",
                    "pDescription":"<strong>Car Prints Design</strong><br>External Car Ad design, visualization, preparation of files for printing...",
                    "figCaption":"Car Prints Design",
                    "photosAmount":"23"
                },
                {
                    "ID":"5",
                    "aLink":"gadgets",
                    "pDescription":"<strong>Gadgets</strong><br>Mugs, Canvas Prints, Photo Wallpapers, Calendars...",
                    "figCaption":"Gadgets",
                    "photosAmount":"11"
                },
                {
                    "ID":"6",
                    "aLink":"rewards",
                    "pDescription":"<strong>Rewards</strong><br>Rewards, Occassional Prints, Statues, Congratulatory Letters, Stickers, Invitations...",
                    "figCaption":"Rewards, Occassional Prints",
                    "photosAmount":"11"
                }
            ]
        },
        {
            "Header":
            {
                "h2Class":"photography",
                "h2Title":"Photography",
                "h2Description":"My photography hobby started when I bought my first used cellphone with a camera from one colleague when I was in military - Nokia 6230i. Here are some of the photos that I took as a hobbyist photographer using mobile cameras, compact camera (Canon A620) and DSLRs (Nikon D90, Pentax K10D) with various lenses (modern and old M42)."
            },
            
            "Thumbnails":
            [
                {
                    "ID":"0",
                    "aLink":"nature",
                    "pDescription":"<strong>Nature Photos<br>Landscapes, foliage, flowers, forests...</strong>",
                    "figCaption":"Nature",
                    "photosAmount":"21"
                },
                {
                    "ID":"1",
                    "aLink":"sky",
                    "pDescription":"<strong>Sky Photos<br>Skies, clouds, night, stars, weather, sunsets...</strong>",
                    "figCaption":"Sky",
                    "photosAmount":"16"
                },
                {
                    "ID":"2",
                    "aLink":"life",
                    "pDescription":"<strong>Living Being Photos<br>Photos of all living things...</strong>",
                    "figCaption":"Life",
                    "photosAmount":"6"
                },
                {
                    "ID":"3",
                    "aLink":"others",
                    "pDescription":"<strong>Uncategorized Photos<br>Objects, abstract, surreal, cars, products, architecture...</strong>",
                    "figCaption":"Others",
                    "photosAmount":"13"
                }
            ]
        },
        {
            "Header":
            {
                "h2Class":"gamephotography",
                "h2Title":"Game Photography",
                "h2Description":"I enjoy stopping, admiring the details and design, and taking screenshots in every game I'm playing. These are some of the game photos (screenshots) that I took during playing games..."
            },
            
            "Thumbnails":
            [
                {
                    "ID":"0",
                    "aLink":"acorigins",
                    "pDescription":"<strong>Assassin's Creed Origins</strong> (2017)",
                    "figCaption":"Assassin's Creed Origins (2017)",
                    "photosAmount":"63"
                },
                {
                    "ID":"1",
                    "aLink":"acunity",
                    "pDescription":"<strong>Assassin's Creed Unity</strong> (2015)",
                    "figCaption":"Assassin's Creed Unity (2014)",
                    "photosAmount":"49"
                },
                {
                    "ID":"2",
                    "aLink":"hellblade",
                    "pDescription":"<strong>Hellblade: Senua's Sacrifice</strong> (2017)",
                    "figCaption":"Hellblade: Senua's Sacrifice (2017)",
                    "photosAmount":"17"
                },
                {
                    "ID":"3",
                    "aLink":"acsyndicate",
                    "pDescription":"<strong>Assassin's Creed Syndicate</strong> (2015)",
                    "figCaption":"Assassin's Creed Syndicate (2015)",
                    "photosAmount":"41"
                },
                {
                    "ID":"4",
                    "aLink":"nfscarbon",
                    "pDescription":"<strong>Need for Speed Carbon</strong> (2006)",
                    "figCaption":"Need for Speed Carbon (2006)",
                    "photosAmount":"2"
                },
                {
                    "ID":"5",
                    "aLink":"assettocorsa",
                    "pDescription":"<strong>Assetto Corsa</strong> (2014)",
                    "figCaption":"Assetto Corsa (2014)",
                    "photosAmount":"12"
                },
                {
                    "ID":"6",
                    "aLink":"accompetizione",
                    "pDescription":"<strong>Assetto Corsa Competizione</strong> (2019)",
                    "figCaption":"Assetto Corsa Competizione (2019)",
                    "photosAmount":"1"
                }
            ]
        },
        {
            "Header":
            {
                "h2Class":"personaltechblog",
                "h2Title":"Personal Technology Blog",
                "h2Description":"I always enjoyed writing and sharing knowledge with other people to help them understand technology. I've written a few guides in polish in the past and after I started learning programming I created my own simple HTML5 + CSS3 + JavaScript + Bootstrap 4 webpage/blog  where I try to help people understand PCs, software, hardware, audio and games. At the same time it also serves me as a training ground, and a place to share my hobbyist Game Photographs. I constantly learn new things in programming, technologies and SEO and try to implement them gradually to my blog, step by step."
            },
            
            "Thumbnails":
            [
                {
                    "ID":"0",
                    "aLink":"https://reznor.tech/",
                    "pDescription":"<strong>rezno[R].tech<br>Guides, articles, informations, tools, game photos...</strong><br><br>If you are a person who enjoys PC, technology, hardware, software, games, audio, art and you wish to understand them more... then it's the right place.",
                    "figCaption":"rezno[R].tech - Main Page"
                },
                {
                    "ID":"1",
                    "aLink":"https://reznor.tech/pc-technology.html",
                    "pDescription":"<strong>PC, Windows, Software and Technology</strong><br><br>PC, Software, Windows Guides, Tips, Tricks, Web Tools. Free guides, tips, tricks, information about PC, software and technologies. Useful Online Web Tools, programs and apps. For beginners and advanced users.",
                    "figCaption":"Category: PC and Technology"
                },
                {
                    "ID":"2",
                    "aLink":"https://reznor.tech/games-art.html",
                    "pDescription":"<strong>Games, Game Photography and Game Art</strong><br><br>All my guides associated with gaming or software used for games. As a hobby I'm also doing Game Photography and creating Photo Albums from most beautiful games ever created.",
                    "figCaption":"Category: Games and Art"
                },
                {
                    "ID":"3",
                    "aLink":"https://reznor.tech/audio-sound.html",
                    "pDescription":"<strong>Audio and Sound</strong><br><br>Sound Guides, Information and everything else about Audio and Sound: How to improve your general audio quality and music/games/movies experience on PC and Windows? What software to use? What hardware to buy for your needs? What is the difference between audio formats? Here you will find all the answers.",
                    "figCaption":"Category: Audio and Sound"
                },
                {
                    "ID":"4",
                    "aLink":"https://reznor.tech/guide-how-upload-instagram-pc-without-android-emulator.html",
                    "pDescription":"<strong>How to upload photos/files on Instagram easily on PC in your browser without installing anything?<br>[ Quick & Easy Guide ]</strong><br><br>Were you always annoyed by Instagram's restrictive policy about uploading photos? Have you wondered if it's possible to upload files on Instagram without installing the app on your phone or an Android emulator on your PC? rezno[R].tech will show you how to do it - easily and just in a few simple steps.",
                    "figCaption":"PC and Technology Guide"
                },
                {
                    "ID":"5",
                    "aLink":"https://www.deviantart.com/reznor666/journal/GPU-FPS-i-CPU-FPS-jaka-roznica-634935215",
                    "pDescription":"<strong>GPU-FPS i CPU-FPS - inne spojrzenie na licznik FPS w grach<br>[Guide in Polish]</strong><br><br>A humble amateur guide with some FPS graphs, % and comparisons, that I've written once for a forum. I write about how to understand FPS in games and I divide FPS into two kinds - CPU-FPS and GPU-FPS. There are some tips and insights about RAM, configuration of games, graphics options, comparisons of the effects of RAM speeds and RAM configuration on games in certain situations.",
                    "figCaption":"PC and Technology Guide"
                },
                {
                    "ID":"6",
                    "aLink":"https://reznor.tech/guide-move-games-other-disk-partition-drive-folder-uplay.html",
                    "pDescription":"<strong>How to move installed games into another partition, folder, disk or pendrive without downloading it again - UPlay<br>[ Quick & Easy Guide ]</strong><br><br>Ubisoft's UPlay platform currently doesn't have any built-in 'move game to another drive' feature. Nevertheless, nothing is impossible and there is a simple solution for that. You will be probably really surprised how simple it actually is, and that we will only use our Windows system for it.",
                    "figCaption":"Game Guide"
                },
                {
                    "ID":"7",
                    "aLink":"https://reznor.tech/guide-best-sound-settings-windows.html",
                    "pDescription":"<strong>Best possible global sound settings in Windows Vista/7/8/10.<br>[ Detailed Guide ]</strong><br><br>Have you ever wondered if it's possible to improve your audio quality on PC without changing your hardware audio gear? Yes it is! Here you can find out how in this detailed guide. This big, comprehensive guide is divided into three more specific sub-categories: Most optimal sound settings for music, games, movies [writing in progress]",
                    "figCaption":"Audio and Sound Guide"
                },
                {
                    "ID":"8",
                    "aLink":"https://reznor.tech/what-is-3d-surround-sound-virtualization.html",
                    "pDescription":"<strong>What is 3D surround sound virtualization?<br>[ Info Guide ]</strong><br><br>Playing games and watching movies often involves using various software surround sound virtualization algorithms present on most sound cards or in the games itself - like for example Creative's SBX Pro Studio Surround, CMSS-3D, Asus' Dolby Headphone or other built-in technologies like Dolby Atmos for Headphones, Windows Sonic for Headphones.",
                    "figCaption":"Audio and Sound Info Guide"
                },
                {
                    "ID":"9",
                    "aLink":"https://reznor.tech/guide-3d-sound-games-movies-configuration.html",
                    "pDescription":"<strong>How to properly configure 3D surround sound virtualization for headphones in Windows Vista/7/8/10.<br>[ Guide ]</strong><br><br>This guide is made for people who like playing games and watching movies on headphones while using various software surround sound virtualization algorithms present on most sound cards - like for example Creative's SBX Pro Studio Surround or older CMSS-3D or Asus' Dolby Headphone. [writing in progress]",
                    "figCaption":"Audio and Sound Guide"
                },
                {
                    "ID":"10",
                    "aLink":"https://reznor.tech/differences-lossless-lossy-sound-audio-formats.html",
                    "pDescription":"<strong>FLAC vs mp3: Differences in lossless vs lossy audio sound formats<br>[ Quick Information ]</strong><br><br>Is lossless really worth the extra disk space it takes over the lossy formats? Here I will write about the differences between those two - and when and how much they should matter for the end user.",
                    "figCaption":"Audio and Sound Information"
                },
                {
                    "ID":"11",
                    "aLink":"https://reznor.tech/guide-how-to-install-asio-for-any-sound-card-or-dac.html",
                    "pDescription":"<strong>How to install and enable ASIO for ANY sound card or DAC?<br>[ Quick Guide ]</strong><br><br>In this quick guide you will learn in a few easy steps on how to quickly install and enable ASIO drivers on ANY sound card or USB DAC in Windows through the free tool - ASIO4ALL.",
                    "figCaption":"Audio and Sound Software Guide"
                },
                {
                    "ID":"12",
                    "aLink":"https://reznor.tech/assetto-corsa-all-car-sounds-collection.html",
                    "pDescription":"<strong>Assetto Corsa Car Sounds: The Full Collection<br>[ PC - 4K 60fps ]</strong><br><br>Assetto Corsa has one of the most true-to-life and authentic car sounds recordings to date. This is a tribute I did for the developers of this racing simulator/game: all 178 official cars recorded across all camera views (includes all DLCs and Bonus Packs).",
                    "figCaption":"Audio Quality in Racing Games (178 Videos)"
                }
            ]
        }
    ]

}